# -*- coding: utf-8 -*-
"""
相机参数配置
"""
import numpy as np
# 相机内参矩阵

# 相机内参矩阵
CAMERA_MATRIX = np.array([
    [1017.1054024671, 0.0000000000, 594.2963265338],
    [0.0000000000, 1051.7893348207, 269.8126285562],
    [0.0000000000, 0.0000000000, 1.0000000000]
], dtype=np.float64)

# 畸变系数
DIST_COEFFS = np.array((0.0333958481, -0.5988507782, -0.0271062766, 0.0389040293, 1.2065577248), dtype=np.float64)


# 归一化相机矩阵 (224x224)
NORMALIZATION_CAMERA_MATRIX = np.array([
    [1017, 0., 112],
    [0., 1051, 112],
    [0., 0., 1.]
], dtype=np.float64)



# 示例：常用的相机内参（可根据实际相机标定结果修改）
# 相机内参矩阵
#CAMERA_MATRIX = np.array([
    #[1147.5284206505, 0.0000000000, 357.4020593775],
    #[0.0000000000, 1165.4136229150, 451.9193949829],
    #[0.0000000000, 0.0000000000, 1.0000000000]
#], dtype=np.float64)

##畸变系数（如无畸变可全0）
#DIST_COEFFS = np.array((0.3977299886, -0.8518662692, 0.0867918716, -0.0027256783, 1.5105245502), dtype=np.float64)

#NORMALIZATION_CAMERA_MATRIX = np.array([
    #[1147., 0., 112],
    #[0., 1165., 112.],
    #[ 0., 0., 1.]
#], dtype=np.float64)
